This is a **solid summary of Pandas DataFrame Indexing**,

---

## âœ… Pandas Indexing: Key Concepts

### ðŸ”¹ 1. **Access the index**

```python
df.index
```

ðŸ§  Tells you how rows are labeled (default: `RangeIndex`).

---

### ðŸ”¹ 2. **Set a column as index**

```python
df.set_index('Name')
```

ðŸ§  Makes `Name` the row label â€” useful when you want to use `.loc[]` based on that.

---

### ðŸ”¹ 3. **Reset the index**

```python
df.reset_index()
```

ðŸ§  Brings the index back to 0, 1, 2â€¦ and makes the old index a column.

---

### ðŸ”¹ 4. **Access a row by index label**

```python
df_with_index.loc['Alice']
```

ðŸ§  Works only if `'Alice'` is the index label (e.g. after setting `Name` as index).

---

### ðŸ”¹ 5. **Change index to any other column**

```python
df.set_index('Age')
```

ðŸ§  Allows label-based navigation using `.loc[30]` etc.

---

In [61]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

In [63]:
df = pd.DataFrame(data)
print(df)
df.index

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

RangeIndex(start=0, stop=5, step=1)

In [65]:
df_coustomIndex = df.set_index('Name')
print(df_coustomIndex)

         Age  Gender  Salary
Name
John      25    Male   50000
Alice     30  Female   55000
Bob       22    Male   40000
Eve       35  Female   70000
Charlie   28    Male   48000

In [18]:
df_genderIndex = df.set_index('Age')
print(df_genderIndex)

        Name  Gender  Salary
Age
25      John    Male   50000
30     Alice  Female   55000
22       Bob    Male   40000
35       Eve  Female   70000
28   Charlie    Male   48000

In [22]:
df_reset = df.reset_index()
print(df_reset)

   index     Name  Age  Gender  Salary
0      0     John   25    Male   50000
1      1    Alice   30  Female   55000
2      2      Bob   22    Male   40000
3      3      Eve   35  Female   70000
4      4  Charlie   28    Male   48000

## ðŸ§  Quick Check for You (Answer These):

1. What happens if you use `df.loc['Alice']` **before** setting `Name` as index?
2. After running `df.set_index('Age')`, how would you access all rows where Age is 25?
3. How do you reset index *without* keeping the old one as a column?

Once you answer these, Iâ€™ll give you a **hands-on task** with a twist â€” you'll use `.loc[]` and `.set_index()` to simulate a mini lookup system!

In [67]:
'''
âœ… 1. What happens if you use df.loc['Alice'] before setting Name as index?
You said: KeyError â€” and that is absolutely correct. âœ…
Because the default index is 0, 1, 2... â€” not 'Alice'.
To make 'Alice' work with .loc[], you first have to do:
'''
#print(df.loc['Alice'])
df = df.set_index('Name')

In [69]:
'''
âœ… 2. After running df.set_index('Age'), how would you access all rows where Age is 25?

'''
df = df.set_index('Age')

df.loc[25]

Gender     Male
Salary    50000
Name: 25, dtype: object

In [71]:
index_age

     Gender  Salary
Age
25     Male   50000
30   Female   55000
22     Male   40000
35   Female   70000
28     Male   48000

In [75]:
df.reset_index(drop=True)

   Gender  Salary
0    Male   50000
1  Female   55000
2    Male   40000
3  Female   70000
4    Male   48000

In [91]:
employee_data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}
df = pd.DataFrame(employee_data)


'''
Load the employee data again

Set 'Name' as the index

Use .loc[] to print the row for "Eve"

Reset the index (without keeping "Name" as a column)
'''

'\nLoad the employee data again\n\nSet \'Name\' as the index\n\nUse .loc[] to print the row for "Eve"\n\nReset the index (without keeping "Name" as a column)\n'

In [93]:
df = df.set_index('Name')

In [99]:
df.loc['Eve']

Age           35
Gender    Female
Salary     70000
Name: Eve, dtype: object

Simple Rule:
.iloc[] â†’ use numbers (df.iloc[0])

.loc[] â†’ use labels (df.loc['Eve'])

In [102]:
df = df.reset_index(drop=True)

In [104]:
df

   Age  Gender  Salary
0   25    Male   50000
1   30  Female   55000
2   22    Male   40000
3   35  Female   70000
4   28    Male   48000